omnibeesbd/05_SCN005_CancelRQ.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://schemas.datacontract.org/2004/07/Pull.BLL.Models" xmlns:ns2="http://tempuri.org/" xmlns:ns3="http://schemas.datacontract.org/2004/07/Pull.BLL.Models.OTA"><SOAP-ENV:Body><ns2:SendHotelResCancel><ns2:login><ns1:Password>WO5bYE2A</ns1:Password><ns1:UserName>BugSoftware</ns1:UserName></ns2:login><ns2:ota_CancelRQ><ns3:EchoToken>1154782d-ea51-478e-a2c2-02b66b5339c2</ns3:EchoToken><ns3:PrimaryLangID>en</ns3:PrimaryLangID><ns3:Target>Test</ns3:Target><ns3:TimeStamp>2019-08-28T12:08:12</ns3:TimeStamp><ns3:UniqueID><ns3:UniqueID><ns3:ID>RES036473-1053</ns3:ID><ns3:Reason>Cancelation reason</ns3:Reason><ns3:Type>Reservation</ns3:Type></ns3:UniqueID></ns3:UniqueID><ns3:Verification><ns3:HotelRef><ns3:ChainCode>986</ns3:ChainCode><ns3:HotelCode>1053</ns3:HotelCode></ns3:HotelRef><ns3:ReservationTimeSpan><ns3:End>2020-07-13T00:00:00</ns3:End><ns3:Start>2020-07-06T00:00:00</ns3:Start></ns3:ReservationTimeSpan></ns3:Verification><ns3:Version>2.6</ns3:Version></ns2:ota_CancelRQ></ns2:SendHotelResCancel></SOAP-ENV:Body></SOAP-ENV:Envelope>